        // window.onload 이벤트 리스너 등록
        window.onload = function() {
            // 버튼 요소 가져오기
            var myButton = document.getElementById("myButton");
        
            // 버튼 클릭 이벤트 리스너 등록
            myButton.addEventListener("click", function() {
              // 결과값 계산
              var result = selectItemWithProbability();
        
              // 결과값 출력
              var drawElement = document.querySelector(".draw");
              drawElement.src = "images/nikke/" + result + ".jpg";
            });
        
            // 항목 선택 함수
            function selectItemWithProbability() {
              var items = ["iDoll썬", "iDoll오션", "iDoll플라워", "솔져O.W.", "솔져F.A.", "솔져E.G.", "프로덕트23", "프로덕트12", "프로덕트08", "미카", "벨로타", "아니스", "델타", "네온", "라피", "에테르", "미하라", "N102", "비스킷", "소다", "코코아", "바이퍼", "자칼", "라플라스", "헬름", "베스티", "페퍼", "밀크", "율하", "루피", "도라", "노벨", "리타", "메이든", "폴크방", "노이즈", "볼륨", "아리아", "에피넬", "얀", "루드밀라", "길로틴", "애드미", "메어리", "크로우", "드레이크", "은화", "센티", "디젤", "솔린", "브리드", "미란다", "폴리", "시그널", "율리아", "프림", "프리바티", "유니", "엠마", "앨리스", "엑시아", "슈가", "맥스웰", "모더니아", "라푼젤", "이사벨", "홍련", "노아", "스노우화이트", "하란", "D"];
              var probabilities = [0.058889, 0.058889, 0.058889, 0.058889, 0.058889, 0.058889, 0.058889, 0.058889, 0.058889, 0.047778, 0.047778, 0.047778, 0.047778, 0.047778, 0.047778, 0.047778, 0.047778, 0.047778, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000333, 0.000714, 0.000714, 0.000714, 0.000714, 0.000714, 0.000714, 0.000714, 0.02];
        
              // 각 항목의 누적 확률 계산
              for (var i = 1; i < probabilities.length; i++) {
                probabilities[i] += probabilities[i - 1];
              }
        
              // 0과 1 사이의 난수 생성
              var randomValue = Math.random();
        
              // 난수 값에 따라 항목 선택
              for (var i = 0; i < probabilities.length; i++) {
                if (randomValue < probabilities[i]) {
                  return items[i];
                }
              }
        
              // 누적 확률이 1보다 작은 경우, 마지막 항목 선택
              return items[items.length - 1];
            }
          };